Repository: kavimarkstar/everesports_fire_beta
Catalog: lib/l10n/app_*.arb
Languages: si

source: Everesports
si: එවර්ස්පෝට්ස්

source: Account
si: ගිණුම

source: Content & Display
si: අන්තර්ගතය සහ පෙන්වීම

source: Login
si: ඇතුල් වන්න

source: Display
si: පෙන්වීම

source: Add Social Media
si: සමාජ මාධ්‍ය එකතු කරන්න

source: Language
si: භාෂාව

source: Profile
si: පැතිකඩ

source: Cover
si: ආවරණය

source: Crop
si: කපන්න

source: Image
si: රූපය

source: Edit
si: සංස්කරණය

# usernamecopiedt
source: Username copied
si: පරිශීලක නාමය පිටපත් විය

source: Copied
si: පිටපත් විය

source: User ID:
si: පරිශීලක හැඳුනුම්පත:

source: Upload
si: උඩුගත කරන්න

source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න

source: Uploading...
si: උඩුගත වෙමින්...

source: Change
si: වෙනස් කරන්න

source: Delete
si: මකන්න

source: Save Changes
si: වෙනස්කම් සුරකින්න

source: Cancel
si: අවලංගු කරන්න

source: Selected image not found
si: තෝරාගත් රූපය සොයාගත නොහැකි විය

source: Error updating profile:
si: පැතිකඩ යාවත්කාලීන කිරීමේ දෝෂයක්:

source: Failed to update profile
si: පැතිකඩ යාවත්කාලීන කිරීමට අසමත් විය

source: Profile updated successfully
si: පැතිකඩ සාර්ථකව යාවත්කාලීන කරන ලදී

source: Password cannot be empty
si: මුරපදය හිස් විය නොහැක

source: Username cannot be empty
si: පරිශීලක නාමය හිස් විය නොහැක

source: Name cannot be empty
si: නම හිස් විය නොහැක

source: User ID is missing
si: පරිශීලක හැඳුනුම්පත අස්ථානගත වී ඇත

source: Failed to fetch user:
si: පරිශීලකයා ලබා ගැනීමට අසමත් විය:

source: User not found.
si: පරිශීලකයා සොයාගත නොහැක.

source: Profile image uploaded
si: පැතිකඩ රූපය උඩුගත කරන ලදී

source: Cover photo uploaded
si: ආවරණ රූපය උඩුගත කරන ලදී

source: Profile image deleted
si: පැතිකඩ රූපය මකා දමන ලදී

source: Cover photo deleted
si: ආවරණ රූපය මකා දමන ලදී

source: Delete failed
si: මකා දැමීම අසාර්ථක විය

source: Error deleting image:
si: රූපය මැකීමේ දෝෂයක්:

source: Error cropping image:
si: රූපය කපා හැරීමේ දෝෂයක්:

source: Failed to upload image
si: රූපය උඩුගත කිරීමට අසමත් විය

source: Unknown error
si: නොදන්නා දෝෂයක්

source: Error uploading image:
si: රූපය උඩුගත කිරීමේ දෝෂයක්:

source: Add Games
si: ක්‍රීඩා එකතු කරන්න

source: Please fill all fields.
si: කරුණාකර සියලු ක්ෂේත්‍ර පුරවන්න.

# gameUIDMismatch
source: Game UID and Confirm Game UID do not match.
si: ක්‍රීඩා UID සහ තහවුරු ක්‍රීඩා UID නොගැලපේ.

# gameUIDAlreadyUsed
source: This Game UID is already used for this game. Please use a different UID.
si: මෙම ක්‍රීඩා UID දැනටමත් මෙම ක්‍රීඩාව සඳහා භාවිතා කර ඇත. කරුණාකර වෙනත් UID එකක් භාවිතා කරන්න.

# maxTwoEntries
source: You can only add up to 2 entries for this game.
si: ඔබට මෙම ක්‍රීඩාව සඳහා උපරිම ඇතුළත් කිරීම් 2ක් පමණක් එකතු කළ හැක.

source: Game added successfully!
si: ක්‍රීඩාව සාර්ථකව එකතු කරන ලදී!

source: No games added yet.
si: තවමත් ක්‍රීඩා එකතු කර නැත.

source: Please log in to comment.
si: කරුණාකර අදහස් දැක්වීමට පුරනය වන්න.

# errorAddingComment
source: Error adding comment: {error}
si: අදහස එක් කිරීමේ දෝෂයක්: {error}

# daysAgo
source: d ago
si: දිනකට පෙර

# hoursAgo
source: h ago
si: පැයකට පෙර

# minutesAgo
source: m ago
si: මිනිත්තුවකට පෙර

source: Just now
si: දැන්ම

source: Hide replies
si: ප්‍රතිචාර සඟවන්න

# showReplies
source: Show {count} replies
si: ප්‍රතිචාර {count} පෙන්වන්න

source: Save
si: සුරකින්න

source: Reply
si: ප්‍රතිචාරය

source: Report
si: รายงาน

source: Delete Comment
si: අදහස මකන්න

# deleteCommentConfirm
source: Are you sure you want to delete this comment?
si: ඔබට මෙම අදහස මැකීමට අවශ්‍යද?

# reportedComment
source: Comment reported.
si: අදහස වාර්තා කරන ලදී.

source: Comments
si: අදහස්

source: Retry
si: නැවත උත්සාහ කරන්න

source: No comments yet.
si: තවමත් අදහස් නැත.

# beFirstToComment
source: Be the first to comment!
si: පළමු අදහස දැක්වන්න!

source: Write a comment...
si: අදහසක් ලියන්න...

source: Error:
si: දෝෂය:

source: Share Post
si: පෝස්ට් එක බෙදාගන්න

source: Edit your comment
si: ඔබේ අදහස සංස්කරණය කරන්න

# noAlbumsFound
source: No albums found. Create one below.
si: ඇල්බම් කිසිවක් හමු නොවීය. පහත නව ඇල්බමයක් සාදන්න.

source: Please log in to like posts.
si: පෝස්ට් වලට කැමති වීමට පුරනය වන්න.

source: Error liking post.
si: පෝස්ට් එකට කැමති වීමේ දෝෂයක්.

source: No posts yet.
si: තවමත් පෝස්ට් නැත.

# beFirstToShare
source: Be the first to share!
si: පළමු වරට බෙදාගන්න!

source: Refresh
si: නැවත පූරණය කරන්න

source: Upload coming soon!
si: උඩුගත කිරීම ඉක්මනින්!

source: Create Post
si: පෝස්ට් එකක් සාදන්න

source: Unfollow
si: අනුගමනය කිරීම නවත්වන්න

# unfollowFailed
source: Failed to unfollow: {error}
si: අනුගමනය කිරීම නවත්වීමට අසමත් විය: {error}

source: Follow
si: අනුගමනය කරන්න

# followFailed
source: Failed to follow: {error}
si: අනුගමනය කිරීමට අසමත් විය: {error}

source: Please log in to share posts.
si: පෝස්ට් බෙදා ගැනීමට පුරනය වන්න.

source: Copy Link
si: සබැඳිය පිටපත් කරන්න

source: Link copied!
si: සබැඳිය පිටපත් විය!

source: Facebook
si: ෆේස්බුක්

source: WhatsApp
si: වට්ස්ඇප්

source: More
si: තවත්

source: Download
si: බාගන්න

source: No image to download.
si: බාගැනීමට රූපයක් නැත.

source: Failed to decode image.
si: රූපය විකේතනය කිරීමට අසමත් විය.

source: Download not supported on web.
si: වෙබ් මත බාගැනීම සහය නොදක්වයි.

source: Save Image
si: රූපය සුරකින්න

source: Saved to Downloads.
si: බාගත කිරීම් වෙත සුරකින ලදී.

source: Please log in to bookmark posts.
si: පෝස්ට් සලකුණු කිරීමට පුරනය වන්න.

source: Select Albums
si: ඇල්බම් තෝරන්න

source: New Album Name
si: නව ඇල්බමයේ නම

source: Create Album
si: ඇල්බමයක් සාදන්න

source: Show less
si: අඩු පෙන්වන්න

source: Show more
si: තවත් පෙන්වන්න
